Repository: Liturgical-Calendar/UnitTestInterface
Catalog: i18n/*/LC_MESSAGES/litcal.po
Languages: de, es, fr, it, pl, pt, sk

source: There was an error opening the connection to the server over the websocket. Perhaps the server is offline?
de: Es gab einen Fehler beim Öffnen der Verbindung zum Server über das Websocket. Vielleicht ist der Server offline?
es: Hubo un error al abrir la conexión con el servidor a través del websocket. ¿Quizás el servidor está desconectado?
fr: Il y a eu une erreur lors de l'ouverture de la connexion au serveur via le websocket. Peut-être que le serveur est hors ligne ?
it: Si è verificato un errore nell'apertura della connessione al server tramite websocket. Forse il server è offline?
pl: Wystąpił błąd podczas otwierania połączenia z serwerem przez websocket. Być może serwer jest offline?
pt: Houve um erro ao abrir a conexão com o servidor via websocket. Talvez o servidor esteja offline?
sk: Došlo k chybe pri otváraní pripojenia k serveru cez websocket. Možno je server offline?

source: Websocket connected successfully!
de: Websocket erfolgreich verbunden!
es: ¡Websocket conectado con éxito!
fr: Websocket connecté avec succès !
it: Websocket connesso con successo!
pl: Połączenie Websocket powiodło się!
pt: Websocket conectado com sucesso!
sk: Websocket úspešne pripojený!

source: Websocket connection closed.
de: Websocket-Verbindung geschlossen.
es: Conexión de websocket cerrada.
fr: Connexion Websocket fermée.
it: Connessione Websocket chiusa.
pl: Połączenie Websocket zostało zamknięte.
pt: Conexão do websocket fechada.
sk: Websocketové pripojenie bolo ukončené.

source: All tests complete!
de: Alle Tests abgeschlossen!
es: ¡Todas las pruebas completas!
fr: Tous les tests sont terminés !
it: Tutti i test completati!
pl: Wszystkie testy zakończone!
pt: Todos os testes completos!
sk: Všetky testy dokončené!

source: Liturgical Calendar
de: Liturgischer Kalender
es: Calendario Litúrgico
fr: Calendrier liturgique
it: Calendario Liturgico
pl: Kalendarz liturgiczny
pt: Calendário Litúrgico
sk: Liturgický kalendár

source: General Roman
de: Allgemeiner Römischer
es: General Romano
fr: Calendrier romain général
it: Romano Generale
pl: Ogólne rzymskie
pt: Geral Romano
sk: Všeobecný rímsky

source: Response Format
de: Antwortformat
es: Formato de respuesta
fr: Réponse Format
it: Formato di risposta
pl: Format odpowiedzi
pt: Formato de Resposta
sk: Formát odpovede

source: Run Tests
de: Tests ausführen
es: Ejecutar pruebas
fr: Exécuter les tests
it: Esegui i test
pl: Uruchom testy
pt: Executar Testes
sk: Spustiť testy

source: Successful tests:
de: Erfolgreiche Tests:
es: Pruebas exitosas:
fr: Tests réussis :
it: Test riusciti:
pl: Testy zakończone sukcesem:
pt: Testes bem-sucedidos:
sk: Úspešné testy:

source: Failed tests:
de: Fehlgeschlagene Tests:
es: Pruebas fallidas:
fr: Tests échoués :
it: Test falliti:
pl: Testy zakończone niepowodzeniem:
pt: Testes falhados:
sk: Zlyhané testy:

source: Total time for %s tests:
de: Gesamtzeit für %s Tests:
es: Tiempo total para %s pruebas:
fr: Temps total pour %s tests :
it: Tempo totale per %s test:
pl: Całkowity czas %s testów:
pt: Tempo total para %s testes:
sk: Celkový čas pre %s testov:

source: VALIDATE SOURCE DATA
de: QUELLDATEN VALIDIEREN
es: VALIDAR DATOS DE ORIGEN
fr: VALIDER LES DONNÉES SOURCE
it: VALIDA I DATI DI ORIGINE
pl: WERYFIKACJA DANYCH ŹRÓDŁOWYCH
pt: VALIDAR DADOS DE ORIGEM
sk: OVERIŤ ZDROJOVÉ ÚDAJE

source: VALIDATE CALENDAR DATA FOR YEARS FROM 1970 UNTIL
es: VALIDAR DATOS DEL CALENDARIO PARA LOS AÑOS DESDE 1970 HASTA
sk: OVERIŤ ÚDAJE KALENDÁRA PRE ROKY OD 1970 AŽ

source: EXECUTE UNIT TESTS FOR SPECIFIC EVENTS
de: FÜHREN SIE UNIT-TESTS FÜR BESTIMMTE EREIGNISSE AUS
es: EJECUTAR PRUEBAS UNITARIAS PARA EVENTOS ESPECÍFICOS
fr: EXÉCUTER LES TESTS UNITAIRES POUR DES ÉVÉNEMENTS SPÉCIFIQUES
it: ESEGUI TEST UNITARI PER EVENTI SPECIFICI
pl: WYKONYWANIE TESTÓW JEDNOSTKOWYCH DLA OKREŚLONYCH ZDARZEŃ
pt: EXECUTAR TESTES UNITÁRIOS PARA EVENTOS ESPECÍFICOS
sk: SPUSTI JEDNOTKOVÉ TESTY PRE ŠPECIFICKÉ UDALOSTI

source: Loading...
de: Laden...
es: Cargando...
fr: Chargement...
it: Caricamento...
pl: Ładowanie...
pt: Carregando...
sk: Načítava sa...

source: Define a Unit Test for a Liturgical event
de: Definieren Sie einen Unit-Test für ein liturgisches Ereignis
es: Definir una prueba unitaria para un evento litúrgico
fr: Définir un test unitaire pour un événement liturgique
it: Definisci un test unitario per un evento liturgico
pl: Definiowanie testu jednostkowego dla wydarzenia liturgicznego
pt: Definir um Teste Unitário para um evento litúrgico
sk: Definovať jednotkový test pre liturgickú udalosť

source: In order to verify that the liturgical calendar data produced by the API is actually producing correct data, we can create Unit Tests that allow us to verify that events were / were not created in the calendar, or that they have expected dates from year to year.
de: Um zu überprüfen, ob die vom API erzeugten Daten des liturgischen Kalenders tatsächlich korrekte Daten liefern, können wir Unit Tests erstellen, die es uns ermöglichen zu überprüfen, ob Ereignisse im Kalender erstellt wurden oder nicht, oder ob sie von Jahr zu Jahr erwartete Daten haben.
es: Para verificar que los datos del calendario litúrgico producidos por la API son correctos, podemos crear pruebas unitarias que nos permitan verificar que los eventos fueron/no fueron creados en el calendario, o que tienen fechas esperadas de año en año.
fr: Pour vérifier que les données du calendrier liturgique produites par l'API sont correctes, nous pouvons créer des tests unitaires qui nous permettent de vérifier que des événements ont été ou n'ont pas été créés dans le calendrier, ou qu'ils ont des dates attendues d'année en année.
it: Per verificare che i dati del calendario liturgico prodotti dall'API siano effettivamente corretti, possiamo creare test unitari che ci permettano di verificare che gli eventi siano stati creati o meno nel calendario, o che abbiano date previste di anno in anno.
pl: Aby zweryfikować, czy dane kalendarza liturgicznego generowane przez API faktycznie generują poprawne dane, możemy utworzyć testy jednostkowe, które pozwolą nam zweryfikować, czy wydarzenia zostały / nie zostały utworzone w kalendarzu lub czy mają oczekiwane daty z roku na rok.
pt: Para verificar se os dados do calendário litúrgico produzidos pela API estão realmente corretos, podemos criar Testes Unitários que nos permitam verificar se os eventos foram ou não criados no calendário, ou se têm datas esperadas de ano para ano.
sk: Aby sme overili, že údaje liturgického kalendára vytvorené API skutočne produkujú správne údaje, môžeme vytvoriť jednotkové testy, ktoré nám umožnia overiť, či boli udalosti vytvorené v kalendári alebo nie, alebo či majú očakávané dátumy z roka na rok.

source: Edit an existing test
de: Einen bestehenden Test bearbeiten
es: Editar una prueba existente
fr: Modifier un test existant
it: Modifica test esistente
pl: Edycja istniejącego testu
pt: Editar um teste existente
sk: Upraviť existujúci test

source: Create a New Test
de: Erstelle einen neuen Test
es: Crear una nueva prueba
fr: Créer un nouveau test
it: Crea un nuovo test
pl: Utwórz nowy test
pt: Criar um Novo Teste
sk: Vytvoriť nový test

source: Calendar to test
de: Kalender zum Testen
es: Calendario a probar
fr: Calendrier à tester
it: Calendario da testare
pl: Kalendarz do przetestowania
pt: Calendário para teste
sk: Kalendár na testovanie

source: Test Type
de: Testtyp
es: Tipo de prueba
fr: Type de test
it: Tipo di test
pl: Typ testu
pt: Tipo de Teste
sk: Typ testu

source: In the span of years for which we are making an assertion, we assert that the liturgical event should exist, and should fall on an expected date (date can optionally be defined differently for each given year)
de: Im Zeitraum der Jahre, für die wir eine Behauptung aufstellen, behaupten wir, dass das liturgische Ereignis existieren sollte und an einem erwarteten Datum stattfinden sollte (das Datum kann optional für jedes gegebene Jahr unterschiedlich definiert werden)
es: En el lapso de años para los cuales estamos haciendo una afirmación, afirmamos que el evento litúrgico debe existir y debe caer en una fecha esperada (la fecha puede definirse opcionalmente de manera diferente para cada año dado)
fr: Pour la période d'années pour laquelle nous faisons une assertion, nous affirmons que l'événement liturgique doit exister et doit tomber à une date prévue (la date peut éventuellement être définie différemment pour chaque année donnée)
it: Nel periodo di anni per cui stiamo facendo un'affermazione, affermiamo che l'evento liturgico dovrebbe esistere e dovrebbe cadere in una data prevista (la data può essere definita diversamente per ogni anno dato)
pl: W przedziale lat, dla których dokonujemy twierdzenia, twierdzimy, że wydarzenie liturgiczne powinno istnieć i powinno przypadać na oczekiwaną datę (data może być opcjonalnie zdefiniowana inaczej dla każdego roku)
pt: No intervalo de anos para o qual estamos fazendo uma afirmação, afirmamos que o evento litúrgico deve existir e deve ocorrer em uma data esperada (a data pode ser definida opcionalmente de forma diferente para cada ano dado)
sk: V časovom rozpätí, pre ktoré robíme tvrdenie, tvrdíme, že liturgická udalosť by mala existovať a mala by pripadnúť na očakávaný dátum (dátum môže byť voliteľne definovaný odlišne pre každý daný rok)

source: Exact date
de: Genaues Datum
es: Fecha exacta
fr: Date exacte
it: Data esatta
pl: Dokładna data
pt: Data exata
sk: Presný dátum

source: When a liturgical event should only exist after a certain year, we assert that for a certain span of years before such year the liturgical event should not exist, while for a certain span of years after such year the liturgical event should exist and should fall on an expected date (date can optionally be defined differently for each given year).
de: Wenn ein liturgisches Ereignis erst nach einem bestimmten Jahr existieren soll, stellen wir sicher, dass es für einen bestimmten Zeitraum vor diesem Jahr nicht existieren sollte, während es für einen bestimmten Zeitraum nach diesem Jahr existieren sollte und an einem erwarteten Datum fallen sollte (das Datum kann optional für jedes Jahr unterschiedlich definiert werden).
fr: Lorsqu'un événement liturgique ne doit exister qu'après une certaine année, nous affirmons que pour une certaine période d'années avant cette année, l'événement liturgique ne devrait pas exister, tandis que pour une certaine période d'années après cette année, l'événement liturgique devrait exister et devrait tomber à une date attendue (la date peut éventuellement être définie différemment pour chaque année donnée).
it: Quando un evento liturgico dovrebbe esistere solo dopo un certo anno, si asserisce che per un certo intervallo di anni prima di tale anno l'evento liturgico non dovrebbe esistere, mentre per un certo intervallo di anni dopo tale anno l'evento liturgico dovrebbe esistere e dovrebbe cadere in una data prevista (la data può essere definita opzionalmente in modo diverso per ciascun anno).
pl: Gdy wydarzenie liturgiczne powinno zaistnieć dopiero po pewnym roku, twierdzimy, że przez pewien okres lat przed tym rokiem wydarzenie liturgiczne nie powinno zaistnieć, podczas gdy przez pewien okres lat po tym roku wydarzenie liturgiczne powinno zaistnieć i powinno przypadać na oczekiwaną datę (data może być opcjonalnie zdefiniowana inaczej dla każdego roku).
pt: Quando um evento litúrgico deve existir apenas após um certo ano, afirmamos que por um certo período de anos antes desse ano o evento litúrgico não deve existir, enquanto por um certo período de anos após esse ano o evento litúrgico deve existir e deve cair em uma data esperada (a data pode ser definida opcionalmente de forma diferente para cada ano dado).
sk: Keď by liturgická udalosť mala existovať až po určitom roku, tvrdíme, že počas určitého obdobia rokov pred týmto rokom by liturgická udalosť nemala existovať, zatiaľ čo počas určitého obdobia rokov po tomto roku by liturgická udalosť mala existovať a mala by pripadnúť na očakávaný dátum (dátum môže byť voliteľne definovaný inak pre každý daný rok).

source: Exact date since year
de: Genaues Datum seit Jahr
es: Fecha exacta desde el año
fr: Date exacte depuis l'année
it: Data esatta dall'anno
pl: Dokładna data od roku
pt: Data exata desde o ano
sk: Presný dátum od roku

source: When a liturgical event should no longer exist after a certain year, we assert that for a certain span of years before such year the liturgical event should fall on an expected date (date can optionally be defined differently for each given year), while for a certain span of years after such year the liturgical event should not exist.
de: Wenn ein liturgisches Ereignis nach einem bestimmten Jahr nicht mehr existieren sollte, behaupten wir, dass es für einen bestimmten Zeitraum vor diesem Jahr an einem erwarteten Datum stattfinden sollte (das Datum kann optional für jedes gegebene Jahr unterschiedlich definiert werden), während es für einen bestimmten Zeitraum nach diesem Jahr nicht existieren sollte.
fr: Lorsqu'un événement liturgique ne doit plus exister après une certaine année, nous affirmons que pour une certaine période d'années avant cette année, l'événement liturgique doit tomber à une date prévue (la date peut éventuellement être définie différemment pour chaque année donnée), tandis que pour une certaine période d'années après cette année, l'événement liturgique ne doit pas exister.
it: Quando un evento liturgico non dovrebbe più esistere dopo un certo anno, affermiamo che per un certo periodo di anni prima di tale anno l'evento liturgico dovrebbe cadere in una data prevista (la data può essere definita diversamente per ogni anno dato), mentre per un certo periodo di anni dopo tale anno l'evento liturgico non dovrebbe esistere.
pl: Kiedy wydarzenie liturgiczne nie powinno już istnieć po pewnym roku, twierdzimy, że przez pewien okres lat przed tym rokiem wydarzenie liturgiczne powinno przypadać na oczekiwaną datę (data może być opcjonalnie zdefiniowana inaczej dla każdego roku), podczas gdy przez pewien okres lat po tym roku wydarzenie liturgiczne nie powinno istnieć.
pt: Quando um evento litúrgico não deve mais existir após um determinado ano, afirmamos que, para um determinado intervalo de anos antes desse ano, o evento litúrgico deve ocorrer em uma data esperada (a data pode ser definida opcionalmente de forma diferente para cada ano dado), enquanto para um determinado intervalo de anos após esse ano, o evento litúrgico não deve existir.
sk: Keď liturgická udalosť už nemá existovať po určitom roku, tvrdíme, že pre určitý časový úsek pred týmto rokom by mala liturgická udalosť pripadnúť na očakávaný dátum (dátum môže byť voliteľne definovaný inak pre každý daný rok), zatiaľ čo pre určitý časový úsek po tomto roku by liturgická udalosť nemala existovať.

source: Exact date until year
de: Genaues Datum bis Jahr
es: Fecha exacta hasta el año
fr: Date exacte jusqu'à l'année
it: Data esatta fino all'anno
pl: Dokładna data do roku
pt: Data exata até o ano
sk: Presný dátum do roka

source: When a liturgical event is expected to be overriden in various years for whatever reason, we assert that it should exist in certain given years on an expected date (date can optionally be defined differently for each given year), and that it should not exist for other given years.
de: Wenn erwartet wird, dass ein liturgisches Ereignis aus verschiedenen Gründen in verschiedenen Jahren überschrieben wird, stellen wir sicher, dass es in bestimmten Jahren an einem erwarteten Datum existieren sollte (das Datum kann optional für jedes Jahr unterschiedlich definiert werden) und dass es in anderen Jahren nicht existieren sollte.
fr: Lorsqu'un événement liturgique est censé être remplacé certaines années pour une raison quelconque, nous affirmons qu'il devrait exister certaines années données à une date attendue (la date peut éventuellement être définie différemment pour chaque année donnée), et qu'il ne devrait pas exister pour d'autres années données.
it: Quando ci si aspetta che un evento liturgico venga sovrascritto in vari anni per qualsiasi motivo, si asserisce che dovrebbe esistere in determinati anni su una data prevista (la data può essere definita opzionalmente in modo diverso per ciascun anno), e che non dovrebbe esistere per altri anni dati.
pl: Kiedy oczekuje się, że wydarzenie liturgiczne zostanie zastąpione w różnych latach z jakiegokolwiek powodu, twierdzimy, że powinno ono istnieć w określonych latach w oczekiwanej dacie (data może być opcjonalnie zdefiniowana inaczej dla każdego danego roku) i że nie powinno istnieć w innych określonych latach.
pt: Quando se espera que um evento litúrgico seja substituído em vários anos por qualquer motivo, afirmamos que ele deve existir em certos anos em uma data esperada (a data pode ser definida opcionalmente de forma diferente para cada ano dado), e que não deve existir em outros anos dados.
sk: Keď sa očakáva, že liturgická udalosť bude v rôznych rokoch z akéhokoľvek dôvodu preložená, tvrdíme, že by mala existovať v určitých rokoch na očakávaný dátum (dátum môže byť voliteľne definovaný odlišne pre každý daný rok) a že by nemala existovať v iných rokoch.

source: Variable existence
de: Variablenexistenz
es: Existencia de variable
fr: Existence de la variable
it: Esistenza variabile
pl: Istnienie zmiennej
pt: Existência da variável
sk: Existencia premennej

source: Name of Test
de: Name des Tests
es: Nombre de la prueba
fr: Nom du test
it: Nome del test
pl: Nazwa testu
pt: Nome do Teste
sk: Názov testu

source: Description
de: Beschreibung
es: Descripción
it: Descrizione
pl: Opis
pt: Descrição
sk: Popis

source: Per year assertions
de: Jährliche Überprüfungen
es: Afirmaciones por año
fr: Assertions par année
it: Asserzioni per anno
pl: Twierdzenia roczne
pt: Afirmações por ano
sk: Ročné tvrdenia

source: Save Unit Test
de: Unit-Test speichern
es: Guardar prueba unitaria
fr: Enregistrer le test unitaire
it: Salva test unitario
pl: Zapisz test jednostkowy
pt: Salvar Teste Unitário
sk: Uložiť jednotkový test

source: Add or Edit Comment
de: Kommentar hinzufügen oder bearbeiten
es: Agregar o editar comentario
fr: Ajouter ou modifier un commentaire
it: Aggiungi o modifica commento
pl: Dodaj lub edytuj komentarz
pt: Adicionar ou Editar Comentário
sk: Pridať alebo upraviť komentár

source: Comment
de: Kommentar
es: Comentario
fr: Commentaire
it: Commento
pl: Komentarz
pt: Comentário
sk: Komentár

source: Save
de: Speichern
es: Guardar
fr: Enregistrer
it: Salva
pl: Zapisz
pt: Salvar
sk: Uložiť

source: Calendars
de: Kalender
es: Calendarios
fr: Calendriers
it: Calendari
pl: Kalendarze
pt: Calendários
sk: Kalendáre

source: Resources
de: Ressourcen
es: Recursos
fr: Ressources
it: Risorse
pl: Zasoby
pt: Recursos
sk: Zdroje

source: API Version
es: Versión de la API
fr: Version de l'API
it: Versione API
pl: Wersja API
pt: Versão da API
sk: Verzia API

source: Websocket connection status
de: Websocket-Verbindungsstatus
es: Estado de la conexión de websocket
fr: Statut de la connexion Websocket
it: Stato della connessione Websocket
pl: Status połączenia websocket
pt: Status da conexão do websocket
sk: Stav pripojenia Websocketu

source: LitCal Project
de: LitCal-Projekt
es: Proyecto LitCal
fr: Projet LitCal
it: Progetto LitCal
pl: Projekt LitCal
pt: Projeto LitCal
sk: Projekt LitCal

source: Unit Tests Admin
es: Administración de pruebas unitarias
fr: Admin des tests unitaires
it: Amministrazione test unitari
pl: Administrator testów jednostkowych
pt: Administração de Testes Unitários
sk: Jednotkové testy Admin

source: Catholic Liturgical Calendar
de: Katholischer Liturgischer Kalender
es: Calendario Litúrgico Católico
fr: Calendrier Liturgique Catholique
it: Calendario Liturgico Cattolico
pl: Katolicki kalendarz liturgiczny
pt: Calendário Litúrgico Católico
sk: Katolícky liturgický kalendár

source: Unit Tests Runner
de: Unit-Test-Läufer
es: Ejecutor de pruebas unitarias
fr: Exécuteur de tests unitaires
it: Esecuzione test unitari
pl: Program uruchamiający testy jednostkowe
pt: Executor de Testes Unitários
sk: Spúšťač jednotkových testov

source: Exact Correspondence Test
de: Exakte Übereinstimmungstest
es: Prueba de Correspondencia Exacta
fr: Test de Correspondance Exacte
it: Test di corrispondenza esatta
pl: Dokładny test zgodności
pt: Teste de Correspondência Exata
sk: Presný test zhody

source: Choose the liturgical event for which you would like to create a test
de: Wählen Sie das liturgische Ereignis aus, für das Sie einen Test erstellen möchten
es: Elige el evento litúrgico para el cual te gustaría crear una prueba
fr: Choisissez l'événement liturgique pour lequel vous souhaitez créer un test
it: Scegli l'evento liturgico per il quale desideri creare un test
pl: Wybierz wydarzenie liturgiczne, dla którego chcesz utworzyć test
pt: Escolha o evento litúrgico para o qual você gostaria de criar um teste
sk: Vyberte si liturgickú udalosť, pre ktorú by ste chceli vytvoriť test

source: This festivity does not seem to exist? Please choose from a value in the list.
es: ¿Esta festividad no parece existir? Por favor, elige un valor de la lista.
fr: Cette festivité ne semble pas exister ? Veuillez choisir une valeur dans la liste.
sk: Zdá sa, že táto slávnosť neexistuje. Prosím, vyberte si hodnotu zo zoznamu.

source: Years to test
de: Jahre zum Testen
es: Años a probar
fr: Années à tester
it: Anni da testare
pl: Lata do przetestowania
pt: Anos para testar
sk: Roky na testovanie

source: First choose the maximum range of years that will belong to the Unit Test.
de: Wählen Sie zuerst den maximalen Zeitraum der Jahre, die zum Unit-Test gehören werden.
es: Primero elige el rango máximo de años que pertenecerá a la prueba unitaria.
fr: Choisissez d'abord la plage maximale d'années qui appartiendra au test unitaire.
it: Per prima cosa scegli l'intervallo massimo di anni che apparterrà al test unitario.
pl: Najpierw wybierz maksymalny zakres lat, które będą należeć do testu jednostkowego.
pt: Primeiro escolha o intervalo máximo de anos que pertencerá ao Teste Unitário.
sk: Najprv vyberte maximálny rozsah rokov, ktoré budú patriť do jednotkového testu.

source: This range should include a few years before the year in which the liturgical event should start to exist.
de: Dieser Zeitraum sollte einige Jahre vor dem Jahr umfassen, in dem das liturgische Ereignis beginnen sollte zu existieren.
es: Este rango debe incluir algunos años antes del año en que el evento litúrgico debe comenzar a existir.
fr: Cette plage doit inclure quelques années avant l'année où l'événement liturgique doit commencer à exister.
it: Questo intervallo dovrebbe includere alcuni anni prima dell'anno in cui l'evento liturgico dovrebbe iniziare a esistere.
pl: Zakres ten powinien obejmować kilka lat przed rokiem, w którym wydarzenie liturgiczne powinno zacząć obowiązywać.
pt: Este intervalo deve incluir alguns anos antes do ano em que o evento litúrgico deve começar a existir.
sk: Tento rozsah by mal zahŕňať niekoľko rokov pred rokom, v ktorom by mala liturgická udalosť začať existovať.
