Repository: Liturgical-Calendar/UnitTestInterface
Catalog: i18n/*/LC_MESSAGES/litcal.po
Languages: de, es, fr, it, pl, pt, sk

source: This range should include a few years after the year in which the liturgical event should cease to exist.
de: Dieser Bereich sollte einige Jahre nach dem Jahr umfassen, in dem das liturgische Ereignis aufhören soll zu existieren.
es: Este rango debería incluir unos años después del año en que el evento litúrgico debería dejar de existir.
fr: Cette période devrait inclure quelques années après l'année où l'événement liturgique devrait cesser d'exister.
it: Questo intervallo dovrebbe includere alcuni anni dopo l'anno in cui l'evento liturgico dovrebbe cessare di esistere.
pl: Zakres ten powinien obejmować kilka lat po roku, w którym wydarzenie liturgiczne powinno przestać istnieć.
pt: Esse intervalo deve incluir alguns anos após o ano em que o evento litúrgico deve deixar de existir.
sk: Tento rozsah by mal zahŕňať niekoľko rokov po roku, v ktorom by liturgická udalosť mala prestať existovať.

source: You can then remove any years that won't be needed.
de: Sie können dann alle Jahre entfernen, die nicht benötigt werden.
es: Luego puedes eliminar los años que no serán necesarios.
fr: Vous pouvez ensuite supprimer les années qui ne seront pas nécessaires.
it: Puoi quindi rimuovere gli anni che non saranno necessari.
pl: Następnie można usunąć wszystkie lata, które nie będą potrzebne.
pt: Você pode então remover quaisquer anos que não serão necessários.
sk: Potom môžeš odstrániť všetky roky, ktoré nebudú potrebné.

source: Finally, set the year from which the liturgical event should exist by clicking on the hammer icon inside one of the years in the range.
de: Legen Sie schließlich das Jahr fest, ab dem das liturgische Ereignis existieren soll, indem Sie auf das Hammer-Symbol in einem der Jahre im Bereich klicken.
es: Finalmente, establece el año desde el cual el evento litúrgico debe existir haciendo clic en el icono del martillo dentro de uno de los años en el rango.
fr: Enfin, définissez l'année à partir de laquelle l'événement liturgique doit exister en cliquant sur l'icône du marteau à l'intérieur de l'une des années de la plage.
it: Infine, imposta l'anno da cui l'evento liturgico dovrebbe esistere cliccando sull'icona del martello all'interno di uno degli anni nell'intervallo.
pl: Na koniec ustaw rok, od którego wydarzenie liturgiczne ma istnieć, klikając ikonę młotka wewnątrz jednego z lat w zakresie.
pt: Finalmente, defina o ano a partir do qual o evento litúrgico deve existir clicando no ícone do martelo dentro de um dos anos do intervalo.
sk: Nakoniec nastavte rok, od ktorého by mala liturgická udalosť existovať, kliknutím na ikonu kladiva v jednom z rokov v rozsahu.

source: Finally, set the year until which the liturgical event should exist by clicking on the hammer icon inside one of the years in the range.
de: Legen Sie schließlich das Jahr fest, bis zu dem das liturgische Ereignis existieren soll, indem Sie auf das Hammer-Symbol in einem der Jahre im Bereich klicken.
es: Finalmente, establece el año hasta el cual el evento litúrgico debe existir haciendo clic en el icono del martillo dentro de uno de los años en el rango.
fr: Enfin, définissez l'année jusqu'à laquelle l'événement liturgique doit exister en cliquant sur l'icône du marteau à l'intérieur de l'une des années de la plage.
it: Infine, imposta l'anno fino al quale l'evento liturgico dovrebbe esistere cliccando sull'icona del martello all'interno di uno degli anni nell'intervallo.
pl: Na koniec ustaw rok, do którego wydarzenie liturgiczne ma istnieć, klikając ikonę młotka wewnątrz jednego z lat w zakresie.
pt: Finalmente, defina o ano até o qual o evento litúrgico deve existir clicando no ícone de martelo dentro de um dos anos do intervalo.
sk: Nakoniec nastavte rok, do ktorého by mala liturgická udalosť existovať, kliknutím na ikonu kladiva v jednom z rokov v rozsahu.

source: Finally, set the years in which the liturgical event shouldn't exist by clicking on the hammer icon inside the years in the range.
de: Legen Sie schließlich die Jahre fest, in denen das liturgische Ereignis nicht existieren sollte, indem Sie auf das Hammer-Symbol innerhalb der Jahre im Bereich klicken.
es: Finalmente, establece los años en los que el evento litúrgico no debería existir haciendo clic en el icono de martillo dentro de los años en el rango.
fr: Enfin, définissez les années pendant lesquelles l'événement liturgique ne devrait pas exister en cliquant sur l'icône du marteau à l'intérieur des années de la plage.
it: Infine, imposta gli anni in cui l'evento liturgico non dovrebbe esistere cliccando sull'icona del martello all'interno degli anni nell'intervallo.
pl: Na koniec ustaw lata, w których wydarzenie liturgiczne nie powinno istnieć, klikając ikonę młotka wewnątrz lat w zakresie.
pt: Finalmente, defina os anos em que o evento litúrgico não deve existir clicando no ícone do martelo dentro dos anos no intervalo.
sk: Nakoniec nastavte roky, v ktorých by liturgická udalosť nemala existovať, kliknutím na ikonu kladiva v rámci rokov.

source: Please set the year from which the liturgical event should exist.
de: Bitte legen Sie das Jahr fest, ab dem das liturgische Ereignis existieren soll.
fr: Veuillez définir l'année à partir de laquelle l'événement liturgique doit exister.
it: Si prega di impostare l'anno da cui l'evento liturgico dovrebbe esistere.
pl: Należy określić rok, od którego wydarzenie liturgiczne ma istnieć.
pt: Por favor, defina o ano a partir do qual o evento litúrgico deve existir.
sk: Prosím, nastavte rok, od ktorého by sa mala liturgická udalosť konať.

source: Please set the year until which the liturgical event should exist.
de: Bitte legen Sie das Jahr fest, bis zu dem das liturgische Ereignis existieren soll.
fr: Veuillez définir l'année jusqu'à laquelle l'événement liturgique devrait exister.
it: Imposta l'anno fino al quale l'evento liturgico dovrebbe esistere.
pl: Należy określić rok, do którego wydarzenie liturgiczne powinno istnieć.
pt: Por favor, defina o ano até o qual o evento litúrgico deve existir.
sk: Prosím, nastavte rok, do ktorého by mala liturgická udalosť existovať.

source: Please set the years in which the liturgical event should not exist.
de: Bitte legen Sie die Jahre fest, in denen das liturgische Ereignis nicht existieren soll.
fr: Veuillez définir les années pendant lesquelles l'événement liturgique ne doit pas exister.
it: Si prega di impostare gli anni in cui l'evento liturgico non dovrebbe esistere.
pl: Należy określić lata, w których wydarzenie liturgiczne nie powinno mieć miejsca.
pt: Por favor, defina os anos em que o evento litúrgico não deve existir.
sk: Prosím, nastavte roky, v ktorých by liturgická udalosť nemala existovať.

source: Set the base date for this liturgical event.
de: Legen Sie das Basisdatum für dieses liturgische Ereignis fest.
fr: Définir la date de base pour cet événement liturgique.
it: Imposta la data base per questo evento liturgico.
pl: Ustaw datę bazową dla tego wydarzenia liturgicznego.
pt: Defina a data base para este evento litúrgico.
sk: Nastav základný dátum pre túto liturgickú udalosť.

source: If the liturgical event is mobile rather than fixed, set the date for the first year you are testing against. In any case you will later be able to adjust the date for each year if needed.
de: Wenn das liturgische Ereignis beweglich statt fest ist, legen Sie das Datum für das erste Jahr fest, gegen das Sie testen. In jedem Fall können Sie das Datum später für jedes Jahr anpassen, falls erforderlich.
es: Si el evento litúrgico es móvil en lugar de fijo, establece la fecha para el primer año contra el que estás probando. En cualquier caso, más tarde podrás ajustar la fecha para cada año si es necesario.
fr: Si l'événement liturgique est mobile plutôt que fixe, définissez la date pour la première année que vous testez. Dans tous les cas, vous pourrez plus tard ajuster la date pour chaque année si nécessaire.
it: Se l'evento liturgico è mobile piuttosto che fisso, imposta la data per il primo anno contro cui stai testando. In ogni caso, potrai successivamente regolare la data per ogni anno se necessario.
pl: Jeśli wydarzenie liturgiczne jest ruchome, a nie stałe, ustaw datę na pierwszy rok, w którym przeprowadzasz test. W każdym przypadku będziesz mógł później dostosować datę dla każdego roku, jeśli zajdzie taka potrzeba.
pt: Se o evento litúrgico for móvel em vez de fixo, defina a data para o primeiro ano que você está testando. Em qualquer caso, você poderá ajustar a data para cada ano, se necessário.
sk: Ak je liturgická udalosť pohyblivá a nie pevná, nastavte dátum na prvý rok, ktorý testujete. V každom prípade budete môcť neskôr upraviť dátum pre každý rok, ak to bude potrebné.

source: The date input cannot be empty.
de: Das Datumsfeld darf nicht leer sein.
fr: La date ne peut pas être vide.
it: L'input della data non può essere vuoto.
pl: Wprowadzona data nie może być pusta.
pt: A entrada de data não pode estar vazia.
sk: Dátumové pole nemôže byť prázdne.

source: Close
de: Schließen
es: Cerrar
fr: Fermer
it: Chiudi
pl: Zamknij
pt: Fechar
sk: Zavrieť

source: Create test
de: Test erstellen
es: Crear prueba
fr: Créer un test
it: Crea test
pl: Utwórz test
pt: Criar teste
sk: Vytvoriť test

source: VALIDATE CALENDAR DATA FOR YEARS FROM 1970 UNTIL %s
de: KALENDERDATEN FÜR DIE JAHRE VON 1970 BIS %s VALIDIEREN
pl: ZATWIERDŹ DANE KALENDARZA NA LATA OD 1970 DO %s
